In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as stats

In [2]:
data=pd.read_csv('/content/drive/MyDrive/DSA WORKS/week8/Week_8_Q&A_dataset - Sheet1.csv')
data

    Gender Test preparation  Total Marks
0     male             none           14
1   female             none           28
2   female             none           18
3   female             none           48
4   female             none           21
5   female        completed           40
6     male             none           30
7   female             none           12
8     male             none           18
9     male             none           24
10    male        completed           44
11    male             none           23
12    male        completed           43
13    male             none           28
14  female             none           41
15  female             none           13
16  female        completed           48
17  female             none           45
18    male             none           47
19    male             none           36
20    male             none           14
21    male        completed           44
22  female             none           41
23  female             none           27
24  female             none           27
25  female             none           38
26  female        completed           50
27  female        completed           43

1. Carry out descriptive analytics on the dataset.

In [3]:
data.describe()

       Total Marks
count    28.000000
mean     32.321429
std      12.454520
min      12.000000
25%      22.500000
50%      33.000000
75%      43.250000
max      50.000000

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Gender            28 non-null     object
 1   Test preparation  28 non-null     object
 2   Total Marks       28 non-null     int64
dtypes: int64(1), object(2)
memory usage: 800.0+ bytes

In [5]:
data.groupby('Gender').count()

        Test preparation  Total Marks
Gender
female                16           16
male                  12           12

In [6]:
data.groupby('Test preparation').count()

                  Gender  Total Marks
Test preparation
completed              7            7
none                  21           21

2 Check whether female and male students scored the same marks.

Null Hypothesis: female and male students scored the same marks

Alternate Hypothesis: female and male students doesn't scored the same marks*

In [8]:
male= data[data['Gender']=='male']
male = male.drop(['Test preparation','Gender'],axis=1)
female= data[data['Gender']=='female']
female = female.drop(['Test preparation','Gender'],axis=1)
male

    Total Marks
0            14
6            30
8            18
9            24
10           44
11           23
12           43
13           28
18           47
19           36
20           14
21           44

In [9]:
female

    Total Marks
1            28
2            18
3            48
4            21
5            40
7            12
14           41
15           13
16           48
17           45
22           41
23           27
24           27
25           38
26           50
27           43

In [10]:
tvalue, pvalue = stats.ttest_ind(male,female)
print('tvalue:',tvalue,'pvalue:',pvalue)

tvalue: [-0.69408853] pvalue: [0.49378223]

In [12]:
tt=(stats.t.ppf((0.05/2), 26))
tt

-2.0555294386428713

In [14]:
if np.abs(tvalue)>np.abs(tt) and pvalue <0.05:
    print('Reject Null Hypothesis: Female and Male score equal marks')
else:
    print('Reject Alternate Hypothesis: Female and Male does not score equal marks')

Reject Alternate Hypothesis: Female and Male does not score equal marks

3. Whether test preparation helps the students?

Null Hypothesis: test preparation helps the students

Alternate Hypothesis: test preparation doesn't helps the students

In [15]:
preprd=data[data['Test preparation']=='completed']
preprd=preprd.drop(['Test preparation','Gender'],axis=1)
notpreprd=data[data['Test preparation']=='none']
notpreprd=notpreprd.drop(['Test preparation','Gender'],axis=1)
preprd

    Total Marks
5            40
10           44
12           43
16           48
21           44
26           50
27           43

In [16]:
notpreprd

    Total Marks
0            14
1            28
2            18
3            48
4            21
6            30
7            12
8            18
9            24
11           23
13           28
14           41
15           13
17           45
18           47
19           36
20           14
22           41
23           27
24           27
25           38

In [17]:
tvalue, pvalue = stats.ttest_ind(preprd,notpreprd)
print('tvalue:',tvalue,'pvalue:',pvalue)

tvalue: [3.61436375] pvalue: [0.00126713]

In [18]:
tt=stats.t.ppf((1-0.05), 26)
tt

1.7056179197592727

In [19]:
if (tvalue>tt and pvalue <0.05):
    print('Reject Null Hypothesis: Test Preparation help students')
else:
    print('Reject Alternate Hypothesis:Test Preparation does not help students')

Reject Null Hypothesis: Test Preparation help students